using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace WebApplication1
{
    public class DB
    {
        public static List<User> userList { get; set; }
        public static List<Recipe> recipeList { get; set; }
        public static List<Category> categoryList { get; set; }
        static DB()
        {
            userList = new List<User>()
            {
                new User(){UserName="אסתר",Password=123,Adress="bney brak",Email="esther.shalti@gmail.com",Phone=0527168916 },
                 new User(){UserName="יעל",Password=567,Adress="herzelia",Email="yael.bengi@gmail.com",Phone=0548466119},
                  new User(){UserName="הדס",Password=689,Adress="kfar saba",Email="hadas.shalev@gmail.com",Phone=0533125444}
            };
            categoryList = new List<Category>()
            {
                new Category(){CategoryCode=1,CategoryName="בשרי",CategoryIcon="burger.png"},
                 new Category(){CategoryCode=2,CategoryName="חלבי",CategoryIcon="pizza-slice.png"},
                 new Category(){CategoryCode=3,CategoryName="פרווה",CategoryIcon="fish.png"}

            };

            recipeList = new List<Recipe>()
            {
                new Recipe(){NameRecipe="פיצה",CategoryRecipe=categoryList[1],Time=110,Difficulty=3,DateAdd=DateTime.Now,Ingredients=new List<string>(){"3.5 כוסות קמח","כפית שמרים יבשים","1/3 כוס שמן זית","כפית סוכר","כף שטוחה מלח","כוס מים חמימים","200 ג' רסק עגבניות","בצל גדול קצוץ ומטוגן","כפית שום כתוש","פלפל שחור גרוס"},
                    Preparetion =new List<string>(){ " להכניס תבנית של תנור הפוכה לתנור, לחמם כ 20 דקות מראש ל 200 מעלות.",
                        "לערבב קמח ושמרים וסוכר טיפה לערבב להוסיף מלח ואת שאר המצרכים, לעבד לבצק ולתת לישה טובה של לפחות כמה דקות במיקסר זה רק עושה טוב לבצק. להוציא מהמיקסר לתת לישה ידנית של דקה ולתת לבצק לנוח כ 20 דקות.",
                        "לרדד ולפזר גבינה צהובה ולאפות עד להזהבה." },UserName="אסתר",Image="פיצה חדש.jpg",View=true },
                new Recipe(){NameRecipe="המבורגר",CategoryRecipe=categoryList[0],Time=90,Difficulty=2,DateAdd=DateTime.Now
                ,Ingredients=new List<string>(){"בשר טחון","בצל גדול","צרור פיטרוזילה","מלח ופלפל","צ'ילי יבש גרוס","ביצה"}
                ,Preparetion=new List<string>(){"לקצוץ את הבצל דק","לקצוץ את הפטרוזליה דק דק","בקערה גדולה לערבב את הבשר עם הבצל, פטרוזיליה ותבליניםת ולערבב היטב","לקרר במשך 1/2 שעה ואח''כ ליצוק ר קציצות בגודל הרצוי ולצלות על הפלנצ'ה עד להשחמה משני הצדדים","בתיאבון!!!"}
                ,UserName="הדס",Image="המבורגר.jpg",View=true },
                new Recipe(){NameRecipe="עוגת שוקולד",CategoryRecipe=categoryList[1],Time=100,Difficulty=1,DateAdd=DateTime.Now,Ingredients=new List<string>(){"150 ג' שוקולד מריר","120 ג' חמאה","200 ג' סוכר לבן","3 ביצים","כפית נס קפה","100 ג' קמח לבן","כף קקאו","1/4 כפית מלח","200 ג' גבינת שמנת","50 ג' חמאה","100 ג' רבקת סוכר","120 מ''ל שמנת מתוקה"},
                    Preparetion =new List<string>(){ "מכינים את בסיס הבראוניז, אופים ומצננים לטמפרטורת החדר: מחממים תנור ל-180 מעלות.", "במיקרוגל ממיסים שוקולד וחמאה ומערבבים לתערובת אחידה.", "בקערה נפרדת טורפים סוכר, ביצים ואבקת קפה נמס במרץ במשך דקה. מוסיפים את תערובת השוקולד וטורפים לאיחוד. מוסיפים קמח, קקאו ומלח וטורפים לתערובת אחידה ומבריקה.","משטחים את התערובת בתבנית מרופדת בנייר אפייה ואופים 12-15 דקות עד ששולי הבראוניז סדוקים ותפוחים. מוציאים מהתנור ומניחים בצד לצינון מלא.",
                        "מכינים את שכבת גבינת השמנת ומצננים במקרר: במיקסר עם וו גיטרה מעבדים גבינה וחמאה במהירות בינונית 2 דקות לתערובת קרמית ואחידה. מוסיפים אבקת סוכר ומעבדים עוד 2 דקות לקרם אחיד.","מורחים את תערובת הגבינה בשכבה אחידה מעל הבראוניז. מעבירים למקרר ל-20-10 דקות (או יותר), להתייצבות.","מכינים את ציפוי השוקולד ומצננים שעתיים במקרר, לפני ההגשה: במיקרוגל מחממים יחד שוקולד, חמאה, שמנת מתוקה וקפה נמס עד להמסה. טורפים לתערובת אחידה ומצננים מעט עד שהתערובת בחום השפתיים.",
"מוזגים את תערובת השוקולד על שכבת הגבינה ומטים את התבנית ימינה ושמאלה, עד שהשוקולד מכסה את שכבת הגבינה לחלוטין.","מחזירים את הבראוניז למקרר לשעתיים נוספות, להמשך התייצבות.ה","פורסים לריבועים בעזרת סכין טבולה במים רותחים (טובלים ומנגבים בין חיתוך לחיתוך), ומגישים. שומרים מכוסה במקרר."},UserName="יעל",Image="עוגה נדירה.jpg",View=true },
                new Recipe(){NameRecipe="פירה",CategoryRecipe=categoryList[2],Time=72,Difficulty=3,DateAdd=DateTime.Now,Ingredients=new List<string>(){"5 תפוחי אדמה בינוניים קלופים","מלח לפי הטעם","קמצות פלפל שחור"},
                    Preparetion =new List<string>(){ "מניחים תפוחי אדמה בסיר ומכסים במים מהברז. מביאים לרתיחה על אש גבוהה.",
                        "לאחר מכן מנמיכים לאש בינונית ומכסים את הסיר (ניתן להשאיר פתח קטן שהאדים ייצאו). ממשיכים לבשל עד שתפוחי האדמה מתרככים (ניתן לבדוק על ידי נעיצת מזלג. אם הוא ננעץ בקלות, תפוחי האדמה מוכנים).",
                        "בעזרת כף מחוררות מוציאים את תפוחי האדמה לקערה (בלי הנוזלים)."
                        ,"מעיכת תפוחי האדמה לפירה:*אם יש לכם מוט בלנדר – טוחנים את תפוחי האדמה בעזרת מוט הבלנדר ואז הוא יוצא במרקם רך ומושלם מבלי שנצטרך להוסיף לו חמאה/שמן או מים.*אם אין לכם מוט בלנדר -אפשר למעוך בעזרת מועך פירה או מזלג ואז להוסיף למחית כמה כפות ממי הבישול  ו 1-2 כפות שמן זית/קנולה ולהמשיך למעוך עד למחית אחידה. אם רוצים לרכך את המחית מוסיפים עוד מים.-ממליחים, מפלפלים ומגישים."},
                    UserName ="אסתר",Image="פירה.jpg",View=true },
                new Recipe(){NameRecipe="פלאפל",CategoryRecipe=categoryList[2],Time=72
                ,Difficulty=3,DateAdd=DateTime.Now,Ingredients=new List<string>(){ "כוס וחצי גרגירי חומוס יבשים ",
                    "כוס עלי כוסברה", "כוס עלי פטרוזיליה","בצל קטן קלוף חצוי","5 שיני שום קלופות","2 כפות גדושות פירורי לחם","3-5 כפות מים","1 כפית אבקת סודה לשתיה","*שמן לטיגון עמוק","תבלינים: כפית מלאה כמון, כפית פפריקה מתוקה, כפית מלאה מלח, רבע כפית פלפל שחור"},
                    Preparetion =new List<string>(){ "מניחים במעבד מזון את גרגירי החומוס, עלי הכוסברה, עלי הפטרוזיליה, בצל קטן חצוי, שיני שום, פלפל ירוק חריף וטוחנים עד לקבלת מרקם גרגירי אחיד. מוסיפים שומשום, פירורי לחם ותבלינים. את המים מוסיפים בהדרגה עד לקבלת מרקם לח ומשחתי, כזה שאפשר ליצור ממנו כדורים יציבים.", "בשלב זה למי שיש זמן – מומלץ להכניס את התערובת למנוחה במקרר במשך חצי שעה-שעה. מי שאין לו זמן- אפשר לוותר על החלק הזה.", "מוסיפים לתערובת כפית אבקת סודה לשתיה ומערבבים היטב (הסודה לשתיה מעניקה אווריריות לפלאפל ומתחילה לפעול מיד לכן מומלץ להוסיף אותה בסוף, לפני הטיגון).",
                        "מחממים סיר קטן עם שמן עמוק (בגובה 3-4 סמ). בעזרת ידיים לחות יוצרים כדורים קטנים בקוטר של כ-3  ומועכים ממש מעט. כשהשמן חם, מוסיפים את הכדורים לשמן (כדור אחר כדור, לא בבת אחת). מטגנים במשך 2-3 דקות, עד להשחמה יפה ומעבירים לנייר סופג (מומלץ לטגן כל פעם 7-9 כדורים, תלוי בקוטר הסיר)." },
                    UserName ="יעל",Image="פלאפל.jpg",View=true },
                new Recipe(){NameRecipe="שניצל",CategoryRecipe=categoryList[0],Time=120,Difficulty=3,DateAdd=DateTime.Now,Ingredients=new List<string>(){ "חזה עוף חתוך לשניצלים", "קמח לציפוי ראשוני של השניצלים","לציפוי2 כוסות פרורי פנקו יפניים בטעם גריל2 כפות שומשום אפשר כמובן להשתמש בפרורי לחם מתובלים.","חזה עוף חתוך לשניצלים קמח לציפוי ראשוני של השניצלים לבלילה: 3 ביצים חצי כפית מלח חצי כפית פלפל שחור גרוס חצי כפית פפריקה מתוקה חצי כפית אבקת שום גבישי 1 כף מיונז 1 כף חרדל דיזון חלק טורפים את הכל היטב לבלילה אחידה."}
,Preparetion=new List<string>(){ "מכינים את השניצלים", "לוקחים צלחת ושמים בה קצת קמח, עוטפים את השניצלים בשכבה דקה של קמח", "טובלים בבלילה של הביצים ומצפים בפרורי פנקו",
    "מטגנים בשמן חצי עמוק עד להזהבה משני הצדדים" },UserName="הדס",Image="שניצל.jpg",View=true },
                new Recipe(){NameRecipe="עוגת גבינה",CategoryRecipe=categoryList[1],Time=60,Difficulty=3,DateAdd=DateTime.Now,Ingredients=new List<string>(){"תחתית:250גרם עוגיות לוטוס,100גרם חמאה", "מלית גבינה: 1.5 מיכלים שמנת מתוקה  38% , כוס סוכר לבן, חבילת פודינג, 500 ג' גבינה לבנה", "לקישוט: 250 ג' עוגיות לוטוס"},
                    Preparetion =new List<string>(){ "טוחנים עוגיות לפירורים ומכינים תחתית: במעבד מזון טוחנים 500 גרם עוגיות לשימוש מפוצל",
                        "מערבבים מחצית מפירורי העוגיות (250 גרם) עם חמאה מומסת למרקם של חול רטוב. מהדקים לתחתית של תבנית משומנת. שומרים במקפיא.",
                        "מכינים את מלית הגבינה, מקשטים בפירורים ומקררים",
                        "מקציפים יחד את חומרי המלית לקרם יציב יחסית. משטחים מעל התחתית."
                    ,"מפזרים את יתרת הפירורים מעל מלית הגבינה.",
                    "מעבירים למקרר ל-4 שעות לפחות לפני ההגשה."},UserName="יעל",Image="עוגת גבינה פירורים.png",View=true },
                new Recipe(){NameRecipe="אלפחורס",CategoryRecipe=categoryList[1],Time=40,Difficulty=3,DateAdd=DateTime.Now,Ingredients=new List<string>(){"200 ג' חמאה","200 ג' אבקת סוכר","3 חלמונים","חבילת פודינג וניל","1.5 כוסות קורנפלור","1.5 כוסות קמח לבן","2 כפיות אבקת אפיה","1/2 כפית אבקת סודה לשתיה","מלית: ריבת חלב","ציפוי: שבבי קוקוס"},
                    Preparetion =new List<string>(){ "בצק אלפחורס: מעבדים חמאה ואבקת סוכר במיקסר עם וו גיטרה לתערובת חלקה ואוורירית. מוסיפים חלמונים ומעבדים, עד שהתערובת אחידה.",
                        "מנפים יחד את שאר החומרים, מוסיפים לתערובת ומעבדים רק עד לבצק אחיד. יוצרים כדור, עוטפים בניילון נצמד ומעבירים למקרר לשעתיים.",
                        "מרדדים את הבצק לעלה בעובי 1/2 ס”מ וקורצים לעיגולים בקוטר 5 ס”מ.מניחים באופן מרווח על תבנית מרופדת בנייר אפייה ואופים 10-12 דקות, עד שהעוגיות מתחילות להזהיב בשוליים ועדיין בהירות במרכז. מצננים לחלוטין." ,
                        "מילוי: מורחים כפית ריבת חלב על חצי מכמות העוגיות. מצמידים להן עוגייה ריקה, ליצירת סנדוויץ’ עוגיות אלפחורס. לוחצים מעט את העוגיות, כדי שהריבה תציץ מהשוליים (אם אוהבים הרבה ריבה, אפשר למרוח על כל הדפנות).",
                        "מגלגלים את העוגיות בקוקוס. בתיאבון" },UserName="אסתר",Image="אלפחורס.jpg",View=true },

            };
        }
    }
}